{"id":"feed/http://www.careerealism.com/feed","direction":"ltr","updated":1418454076259,"title":"CAREEREALISM","alternate":[{"href":"http://www.careerealism.com","type":"text/html"}],"items":[{"id":"lT30xr7kOS7a66DxNqGQNaOW3O/+Y0Z49plprVfMHio=_14a3de44371:7be0fa:4fbd5dc2","keywords":["Job Search","LinkedIn"],"fingerprint":"3960e657","originId":"http://www.careerealism.com/?p=41385","content":{"content":"<p>Is LinkedIn an active part of your job search? Have you maximized your profile, polishing it until it shines?</p>\n<p><strong>Related:</strong> <a href=\"http://www.careerealism.com/linkedin-profile-facelift-tips/\">10 Tips For Giving Your LinkedIn Profile A Facelift</a></p>\n<p>If not, there’s a good chance you’re behind the curve — by about a decade.</p>\n<p>According to LinkedIn, <a target=\"_blank\" href=\"http://blog.linkedin.com/2013/03/25/linkedin-search-just-got-smarter/\">5.7 billion job-oriented searches</a> were done on the platform in 2012. This means that recruiters in your industry are hopping on the social media giant any time they need to locate new talent.</p>\n<p>So, consider what they’re going to find. One professional has a bare-bones LinkedIn profile that includes his name, title, and a basic summary — more or less a copied-and-pasted resume. Another professional includes the same information, but her tone is conversational and full of powerful keywords. She describes past roles in first person, providing insight into critical duties and how she overcame challenges.</p>\n<p>Which professional would you pursue?</p>\n<p>More importantly, which professional are <em>you</em>?</p>\n<p>Spending time on yet another online profile might seem unnecessary, but you should approach it like every other part of the job search. You get your resume just right. You find the perfect interview outfit. Put the same effort into LinkedIn, and recruiters will flock to you.</p>\n<p>Here are four steps to optimizing your LinkedIn profile so it stands out to recruiters:</p>\n<h4>Keep your basic information updated.</h4>\n<p>If you’re employed, include your current company and title. This helps searchers know where you stand on the job front. Some in-house recruiters may not be free to contact you if you work for a competitor, but a staffing agency certainly can.</p>\n<p>Make sure you have an accurate professional timeline so recruiters can see how you measure up to the job requirements.</p>\n<p>Although it sounds simple, updating your contact information is a crucial but commonly overlooked step. You should also include a professional email address (e.g., yourname@gmail.com versus ilovepizza@hotmail.com). If you’re more likely to answer the phone than an email, provide your phone number, as well.</p>\n<h4>Leave out anything that could harm your image.</h4>\n<p>As a general rule, if the information makes you think of Facebook, leave it off. Your dog’s name, your kid’s bath pictures, and the funny joke your best friend told you should never make it to your LinkedIn profile.</p>\n<p>Also remember to keep quiet about trade secrets. Broadcasting your current employer’s proprietary information will be a red flag to recruiters and make you appear untrustworthy. Besides harming your job search, you could potentially lose your current job or face lawsuits.</p>\n<h4>Capitalize on relevant keywords.</h4>\n<p>Use your areas of expertise and specialties to trigger keyword searches. Let’s say a recruiter in your area needs a copywriter. She’ll get on LinkedIn and search for those parameters. The more times you incorporate “copywriter,” “advertising content,” “campaign development,” and other industry words into your profile, the more likely you’ll appear in her search results.</p>\n<p>Don’t just list words in bullet points, though. Expand on your areas of expertise with compelling prose, and position yourself as a subject-matter expert.</p>\n<h4>Don’t forget about the extras.</h4>\n<p>Categories, groups, articles, and awards are all extra areas that should shine on your profile. They’re typically farther down the page, so recruiters scrolling down to see them are likely interested in you as a candidate.</p>\n<p>The relative importance of each of these areas varies by industry. For example, in nonprofit industries, participation in LinkedIn and physical community groups is important. But in warehouse management, not so much.</p>\n<p>Be selective with the categories and groups you choose. Find five to 10 within your industry that garner the most engagement and attention. Besides looking good on your profile, if you become active in these groups and leave insightful comments, you’ll expand your industry knowledge and position yourself as a thought leader. Don’t hesitate to show off your awards, either. Potential employers want to know anything that differentiates you as a candidate.</p>\n<p>LinkedIn has leveled the playing field for in-house recruiters and smaller staffing firms alike —providing a powerful pipeline tool once reserved for deep-pocketed agencies. With such a massive pool of potential candidates out there, you need to stand out any way you can. And with a little effort on LinkedIn, it’s not too difficult.</p>\n<p><em>This is a guest post.</em></p>\n<h3>Related Posts</h3>\n<p><a href=\"http://www.careerealism.com/linkedin-headline-keywords-quick-tip/\">Q&amp;A Quick Tip: Include Keywords In Your LinkedIn Headline</a><br>\n<a href=\"http://www.careerealism.com/linkedin-guide-essential/\">Your Essential LinkedIn Guide: Harness The Awesomeness</a><br>\n<a href=\"http://www.careerealism.com/linkedin-cheat-sheet/\">LinkedIn Cheat Sheet: 5 Tips For A Professional Profile</a></p>\n<p><span>Photo Credit: <a target=\"_blank\" href=\"http://www.shutterstock.com/\">Shutterstock</a></span></p>\n<hr>\n<p>The post <a rel=\"nofollow\" href=\"http://www.careerealism.com/optimizing-linkedin-profile-guide/\">The Pain-Free Guide To Optimizing Your LinkedIn Profile</a> appeared first on <a rel=\"nofollow\" href=\"http://www.careerealism.com\">CAREEREALISM</a>.</p>","direction":"ltr"},"title":"The Pain-Free Guide To Optimizing Your LinkedIn Profile","published":1418367627000,"crawled":1418377577329,"alternate":[{"href":"http://www.careerealism.com/optimizing-linkedin-profile-guide/","type":"text/html"}],"author":"Melissa Cooper","origin":{"streamId":"feed/http://www.careerealism.com/feed","title":"CAREEREALISM","htmlUrl":"http://www.careerealism.com"},"summary":{"content":"<p>Have you maximized your LinkedIn profile, polishing it until it shines? Here's the pain-free guide to optimizing your LinkedIn profile.</p>\n<p>The post <a rel=\"nofollow\" href=\"http://www.careerealism.com/optimizing-linkedin-profile-guide/\">The Pain-Free Guide To Optimizing Your LinkedIn Profile</a> appeared first on <a rel=\"nofollow\" href=\"http://www.careerealism.com\">CAREEREALISM</a>.</p>","direction":"ltr"},"unread":true,"engagement":1,"engagementRate":0.04},{"id":"lT30xr7kOS7a66DxNqGQNaOW3O/+Y0Z49plprVfMHio=_14a33736676:8b62b0:b669a9fb","originId":"http://www.careerealism.com/?p=41354","keywords":["Career Advice","Professional Development"],"fingerprint":"253f4126","content":{"content":"<p>I’m 28, going on 29 years old. I’ve made a lot of very smart decisions in my 20’s as it pertains to my career. I know that sounds arrogant. Believe me, I’m not that kind of guy.</p>\n<p><strong>Related:</strong> <a href=\"http://www.careerealism.com/beat-millennial-stereotypes/\">8 Ways To Beat Millennial Stereotypes And Win Over Employers</a></p>\n<p>My track record proves that I’ve made good decisions because somehow I went from being a college dropout to becoming a marketing manager in a Fortune 10 business at the age of 27.</p>\n<p>Those type of results typically don’t take place until people are well into their mid-40’s. I know this to be the case, because that’s how old my colleagues were.</p>\n<p>As I get closer and closer towards 30, I’ve begun reflecting on my 20’s as well as my generation of Millennials, many of whom are still struggling to find meaning from life.</p>\n<p>Every day I receive emails and messages on Facebook and Twitter from people in their 20’s, as well as high school students. They pour their heart out to me, telling me their stories.</p>\n<p>The advice I give them for making the most of your 20’s in order to advance your career in your 30’s is as follows:</p>\n<h4>1. Take lots of risks</h4>\n<p>In life, the people who win are those who are willing to take risks. As an example, the mass majority of people save versus invest because they’re paranoid about risk. However, without risk, we wouldn’t have an economy. The economy is built upon risk, it’s called businesses, and without them we’d have no jobs and no economy. In your 20’s, don’t be afraid to take risks. If you don’t like your job, quit as soon as possible until you find a job you absolutely love. If you chose the wrong career, quit as soon as possible and start a new one.</p>\n<h4>2. Keep your bills low</h4>\n<p>Bills are a burden, and while it can be tempting to rack up tens of thousands of dollars in student loans, rent an apartment you can’t truly afford, furnish it with a credit card, and lease a BMW, all of these things will destroy you by the time you reach the end of your 20’s. This is important as it pertains to your career, because there will come a time in your late 20’s when you begin to truly discover who you are and what you want to do with your life. What you decide to do may earn less money. If you’ve spent your 20’s racking up a load of debt, you’ll enslave yourself to your previous job commitment just to keep your bills paid.</p>\n<h4>3. Keep your credit clean</h4>\n<p>Your 20’s are a time to establish a solid and positive credit history. Ruin your credit in your 20’s and you could be 40 before you ever get things repaired, and by that point you’re already 10+ years past the point at which you should’ve purchased a home. It’s also important to note that many employers nowadays do credit checks in addition to background checks, and it’s possible that you could be denied a job as a result of your credit score.</p>\n<h4>4. Be nimble</h4>\n<p>You never know where your job or your career will take you. You may have to move across the country for an opportunity, so be ready and willing to get up and go.</p>\n<h4>5. Be open-minded</h4>\n<p>Be open-minded about everything. Your 20’s is a time in which most people begin to develop their belief systems. This includes but is not limited to religion, politics, and career choices. Do not get old and set in your ways in your 20’s. The world changes too rapidly, and just as soon as you’ve decided that you ‘know how things work,’ just that quickly things will change.</p>\n<h4>6. Continue your education</h4>\n<p>High school or college graduation isn’t the end of your education. It’s just the beginning. In your 20’s, your goal should be to learn as many new skills as possible so in case you decide to change careers, you’re flexible and skilled enough to do so.</p>\n<h4>7. Be yourself</h4>\n<p>Don’t ever let someone else tell you what to be or who to be. This includes parents, political parties, bosses, boyfriends, and girlfriends. Be yourself. In the end, that’s all that matters. The world already has enough clones.</p>\n<h4>8. Be patient</h4>\n<p>Young people are inpatient. They want the big promotion now. They want the fancy car and the two-story house today. Keep calm and carry on.</p>\n<h4>9. Have fun</h4>\n<p>Don’t take life too seriously. I did and I regret it. If you’re not having fun in your 20’s, you’ll regret it later on in life. Ask anyone who’s 40 and they’ll tell you.</p>\n<h3>Related Posts</h3>\n<p><a href=\"http://www.careerealism.com/millennials-workplace-generation-gap/\">How Millennials Can Help Bridge The Workplace Generation Gap</a><br>\n<a href=\"http://www.careerealism.com/millennials-arent-lazy/\">Why Millennials Aren’t Really Lazy</a><br>\n<a href=\"http://www.careerealism.com/millennials-cant-get-happy/\">77 Million Millennials Can’t Get Happy – Or Can They?</a></p>\n<hr>\n<p><img height=\"150\" alt=\"Michael Price\" width=\"150\" src=\"http://www.careerealism.com/home/jtodonnell/careerealism.com/wp-content/uploads/2014/10/rsz_1rsz_michael-price.jpg\"></p>\n<h4>About the author</h4>\n<p><a target=\"_blank\" rel=\"nofollow\" href=\"http://michaelpriceless.com\">Michael Price</a> is the author of <em><a target=\"_blank\" rel=\"nofollow\" href=\"http://whatnextquest.com\">What Next? The Millennial’s Guide to Surviving and Thriving in the Real World</a></em>, endorsed by Barbara Corcoran of ABC’s Shark Tank. He is also the founder of <a target=\"_blank\" rel=\"nofollow\" href=\"http://conquercareercourse.com\">Conquer Career Course</a>, where he teaches students how to increase their salary, build a career with longevity and become unemployment-proof. View the trailer below:</p>\n<p> </p>\n<p> </p>\n<p><center><iframe height=\"315\" width=\"560\" allowfullscreen=\"allowfullscreen\" src=\"http://www.youtube.com/embed/Hxrj32vO-Bo?rel=0&amp;showinfo=0\"></iframe></center></p>\n<hr>\n<p><i>Disclosure: This post is sponsored by a CAREEREALISM-approved expert. You can learn more about expert posts </i><a rel=\"nofollow\" href=\"http://careerealism.com/ContentDisclosure.pdf\"><i>here</i></a><i>.</i></p>\n<p><span>Photo Credit: <a target=\"_blank\" href=\"http://www.shutterstock.com/\">Shutterstock</a></span></p>\n<hr>\n<p>The post <a rel=\"nofollow\" href=\"http://www.careerealism.com/advance-career-30s-how/\">How To Make The Most Of Your 20’s To Advance Your Career In Your 30’s</a> appeared first on <a rel=\"nofollow\" href=\"http://www.careerealism.com\">CAREEREALISM</a>.</p>","direction":"ltr"},"published":1418194548000,"title":"How To Make The Most Of Your 20’s To Advance Your Career In Your 30’s","crawled":1418202408566,"alternate":[{"href":"http://www.careerealism.com/advance-career-30s-how/","type":"text/html"}],"author":"Michael Price","origin":{"htmlUrl":"http://www.careerealism.com","streamId":"feed/http://www.careerealism.com/feed","title":"CAREEREALISM"},"summary":{"content":"<p>I'm 28, going on 29 - and I've made smart career decisions. Here's my advice for making the most of your 20’s in order to advance your career in your 30’s.</p>\n<p>The post <a rel=\"nofollow\" href=\"http://www.careerealism.com/advance-career-30s-how/\">How To Make The Most Of Your 20’s To Advance Your Career In Your 30’s</a> appeared first on <a rel=\"nofollow\" href=\"http://www.careerealism.com\">CAREEREALISM</a>.</p>","direction":"ltr"},"visual":{"url":"none"},"unread":true,"engagement":12,"engagementRate":0.33},{"id":"lT30xr7kOS7a66DxNqGQNaOW3O/+Y0Z49plprVfMHio=_14a29bc2529:66de19e:6b730af7","keywords":["Job Search","Personal Brand"],"fingerprint":"b2ba5c8c","originId":"http://www.careerealism.com/?p=41305","content":{"content":"<p>Seth Godin wrote one of the best business books of the last decade. The book I’m referring to is <em>Purple Cow</em>.</p>\n<p><strong>Related:</strong> <a href=\"http://www.careerealism.com/taylor-swift-success/\">What Taylor Swift Can Teach You About Success In Your Career</a></p>\n<p>Purple Cow is a metaphor for distinguishing a point of differentiation.</p>\n<p>In his book, Seth goes on to mention that if you were to drive down a farm road and you saw a field of brown cows, nothing would stand out. You wouldn’t notice one cow from the hundreds of others.</p>\n<p>However, what if you saw a Purple Cow? Your eyes would immediately light up in amazement. You would instantly notice the purple cow and you’ll do everything in your power to get a closer look.</p>\n<p>The idea behind <em>Purple Cow</em> is that businesses should approach their marketing in such a way that they stand out from the competition.</p>\n<p>If a business defies conventional wisdom and redefines the way they market their products and the creative that’s associated with it, they will stand out, leaving customers and prospects in awe.</p>\n<p>Apple does this better than anyone.</p>\n<p>Think about how this can be applied to your career.</p>\n<p>Your average person is just one of hundreds of millions of people looking to get a job.</p>\n<p>As employers sift through the sea of brown cows, how will you stand out from the competition?</p>\n<p>Having a distinguished degree and a slick resume isn’t going to cut it anymore. That’s no longer good enough.</p>\n<p>In a day and age in which competition for jobs is at an all-time high, you have to put tactics into place to ensure that you continue to have a seat at the table.</p>\n<p>After the Great Recession, many people spent months and years complaining about how the recession ruined their job and destroyed their lives. That very well could be true. It’s unjust and it’s unfair.</p>\n<p>However, after the dust settles, all you can do is move forward. The best way to move forward is to be preemptive.</p>\n<p>It’s time to think different.</p>\n<p>If you want to become a Purple Cow in your industry, you have to build a personal brand and market yourself in a way that goes above and beyond the mediocre tactics of the Brown Cow.</p>\n<p>That is the only way you stand a chance of getting the job of your dreams and building the career you’ve always desired.</p>\n<h3>Related Posts</h3>\n<p><a href=\"http://www.careerealism.com/successful-career-overlooked-threats/\">The 8 Most Overlooked Threats To A Successful Career</a><br>\n<a href=\"http://www.careerealism.com/career-secrets-ultra-successful/\">3 Little Career Secrets Of The Ultra-Successful</a><br>\n<a href=\"http://www.careerealism.com/4-career-success/\">4 C’s To Career Success</a></p>\n<hr>\n<p><img height=\"150\" alt=\"Michael Price\" width=\"150\" src=\"http://www.careerealism.com/home/jtodonnell/careerealism.com/wp-content/uploads/2014/10/rsz_1rsz_michael-price.jpg\"></p>\n<h4>About the author</h4>\n<p><a target=\"_blank\" rel=\"nofollow\" href=\"http://michaelpriceless.com\">Michael Price</a> is the author of <em><a target=\"_blank\" rel=\"nofollow\" href=\"http://whatnextquest.com\">What Next? The Millennial’s Guide to Surviving and Thriving in the Real World</a></em>, endorsed by Barbara Corcoran of ABC’s Shark Tank. He is also the founder of <a target=\"_blank\" rel=\"nofollow\" href=\"http://conquercareercourse.com\">Conquer Career Course</a>, where he teaches students how to increase their salary, build a career with longevity and become unemployment-proof. View the trailer below:</p>\n<p> </p>\n<p> </p>\n<p><center><iframe height=\"315\" width=\"560\" allowfullscreen=\"allowfullscreen\" src=\"http://www.youtube.com/embed/Hxrj32vO-Bo?rel=0&amp;showinfo=0\"></iframe></center></p>\n<hr>\n<p><i>Disclosure: This post is sponsored by a CAREEREALISM-approved expert. You can learn more about expert posts </i><a rel=\"nofollow\" href=\"http://careerealism.com/ContentDisclosure.pdf\"><i>here</i></a><i>.</i></p>\n<p><a href=\"http://www.shutterstock.com/gallery-921176p1.html?cr=00&amp;pl=edit-00\">Everett Collection</a> / <a href=\"http://www.shutterstock.com/editorial?cr=00&amp;pl=edit-00\">Shutterstock.com</a></p>\n<hr>\n<p>The post <a rel=\"nofollow\" href=\"http://www.careerealism.com/purple-cow-industry/\">Why You NEED To Be A ‘Purple Cow’ In Your Industry</a> appeared first on <a rel=\"nofollow\" href=\"http://www.careerealism.com\">CAREEREALISM</a>.</p>","direction":"ltr"},"title":"Why You NEED To Be A ‘Purple Cow’ In Your Industry","published":1418022489000,"crawled":1418039403817,"alternate":[{"href":"http://www.careerealism.com/purple-cow-industry/","type":"text/html"}],"author":"Michael Price","origin":{"htmlUrl":"http://www.careerealism.com","streamId":"feed/http://www.careerealism.com/feed","title":"CAREEREALISM"},"summary":{"content":"<p>Having a college degree and a slick resume isn’t going to cut it anymore. That’s no longer good enough. You NEED to be a 'purple cow' in your industry.</p>\n<p>The post <a rel=\"nofollow\" href=\"http://www.careerealism.com/purple-cow-industry/\">Why You NEED To Be A ‘Purple Cow’ In Your Industry</a> appeared first on <a rel=\"nofollow\" href=\"http://www.careerealism.com\">CAREEREALISM</a>.</p>","direction":"ltr"},"visual":{"url":"http://img.youtube.com/vi/Hxrj32vO-Bo/0.jpg","height":360,"width":480,"processor":"feedly-nikon-v3.1","contentType":"image/jpeg"},"unread":true,"engagement":13,"engagementRate":0.28},{"id":"lT30xr7kOS7a66DxNqGQNaOW3O/+Y0Z49plprVfMHio=_14a286b4f21:40166ac:c4302584","keywords":["Career Advice","Career Change"],"fingerprint":"69492bf3","originId":"http://www.careerealism.com/?p=41291","content":{"content":"<p>Once upon a time, jobs offered benefits. These benefits included a matching 401K, pension, retirement fund, and stock options. For most people, those benefits no longer exist.</p>\n<p><strong>Related:</strong> <a href=\"http://www.careerealism.com/key-rules-career-changers/\">5 Key Rules For Career Changers</a></p>\n<p>In fact, you’re lucky if your employer even offers reasonable health insurance benefits.</p>\n<p>As the years have passed, employers have slowly but surely chipped away at employee benefits leaving one to wonder what reason they have to be loyal to an employer.</p>\n<p>It’s like the classic frog in the boiling water scenario. If you put a frog in a pot of water and slowly increase the temperature, they’ll lie there until eventually meeting their demise.</p>\n<p>Are you content with being a frog?</p>\n<p>Everyday you go to work, you’re asked to work harder, work longer hours, and work for diminishing benefits.</p>\n<p>At what point will you stop and turn the tables?</p>\n<p>This issue we’re facing today isn’t isolated. It’s a systemic issue that’s deeply rooted in the American employment model. All hope is not lost as there are still a few companies in existence who still take care of their employees, but for the most part everyone is on their own and left to fend for themselves and establish a retirement fund on their own.</p>\n<p>Now is the time to wake up and smell the coffee, and instead of accepting things for the way that they are, it’s time for you to take action, because things will not get better.</p>\n<p>If you want to maximize your earning potential and enhance your experience in your career, you must become indispensable, you must build a personal brand, you must market yourself in a way in which employers fight one another to give you top dollar for your skills, assets, and abilities.</p>\n<p>The first thing you must do is get rid of the ridiculous notion of job loyalty.</p>\n<p>This goes against all conventional wisdom, but it’s important to rid yourself of this out-dated employment model.</p>\n<p>Employer’s certainly have. They’re completely content with having a revolving door of new hires.</p>\n<p>In the mean time, those who sit silently in their cubicle watching year after year go by with little or no raise and diminishing benefits, lose.</p>\n<p>You need to make sure you’re on the right side of history, and if employers have lost their loyalty to you by taking your benefits away, why should you remain loyal to them?</p>\n<p>If the grass looks greener on the other side, go for it!</p>\n<p>One thing that should be made loud and clear is that this new mindset isn’t about revenge, it’s about self-preservation.</p>\n<p>In this day and age, the longer you stick with an employer the more likely you are to:</p>\n<ul>\n<li>Receive less wages than you’re worth (based on market salary averages)</li>\n<li>Reduce the experience of your career</li>\n<li>Lose opportunities to learn new skills within your career</li>\n</ul>\n<p>The relationship between employee and employer has changed and if you haven’t adjusted, it’s about time you make a change.</p>\n<h3>Related Posts</h3>\n<p><a href=\"http://www.careerealism.com/career-standstill-signs/\">3 Signs Your Career Is At A Standstill</a><br>\n<a href=\"http://www.careerealism.com/why-quit-job-fortune-10-telecom/\">Why I Quit My Good Job At A Fortune 10 Telecom</a><br>\n<a href=\"http://www.careerealism.com/reasons-stay-job-legit-quit/\">Too Legit To Quit: 9 Reasons To Stay At Your Job</a></p>\n<hr>\n<p><img height=\"150\" alt=\"Michael Price\" width=\"150\" src=\"http://www.careerealism.com/home/jtodonnell/careerealism.com/wp-content/uploads/2014/10/rsz_1rsz_michael-price.jpg\"></p>\n<h4>About the author</h4>\n<p><a target=\"_blank\" rel=\"nofollow\" href=\"http://michaelpriceless.com\">Michael Price</a> is the author of <em><a target=\"_blank\" rel=\"nofollow\" href=\"http://whatnextquest.com\">What Next? The Millennial’s Guide to Surviving and Thriving in the Real World</a></em>, endorsed by Barbara Corcoran of ABC’s Shark Tank. He is also the founder of <a target=\"_blank\" rel=\"nofollow\" href=\"http://conquercareercourse.com\">Conquer Career Course</a>, where he teaches students how to increase their salary, build a career with longevity and become unemployment-proof. View the trailer below:</p>\n<p> </p>\n<p> </p>\n<p><center><iframe height=\"315\" width=\"560\" allowfullscreen=\"allowfullscreen\" src=\"http://www.youtube.com/embed/Hxrj32vO-Bo?rel=0&amp;showinfo=0\"></iframe></center></p>\n<hr>\n<p><i>Disclosure: This post is sponsored by a CAREEREALISM-approved expert. You can learn more about expert posts </i><a rel=\"nofollow\" href=\"http://careerealism.com/ContentDisclosure.pdf\"><i>here</i></a><i>.</i></p>\n<p><span>Photo Credit: <a target=\"_blank\" href=\"http://www.shutterstock.com/\">Shutterstock</a></span></p>\n<hr>\n<p>The post <a rel=\"nofollow\" href=\"http://www.careerealism.com/never-loyal-job/\">Why You Should Never Be Loyal To Your Job</a> appeared first on <a rel=\"nofollow\" href=\"http://www.careerealism.com\">CAREEREALISM</a>.</p>","direction":"ltr"},"title":"Why You Should Never Be Loyal To Your Job","published":1417848370000,"crawled":1418017328929,"alternate":[{"href":"http://www.careerealism.com/never-loyal-job/","type":"text/html"}],"author":"Michael Price","origin":{"htmlUrl":"http://www.careerealism.com","streamId":"feed/http://www.careerealism.com/feed","title":"CAREEREALISM"},"summary":{"content":"<p>Every work day, you’re asked to work harder, work longer hours, and work for diminishing benefits. That's why you should never be loyal to your job.</p>\n<p>The post <a rel=\"nofollow\" href=\"http://www.careerealism.com/never-loyal-job/\">Why You Should Never Be Loyal To Your Job</a> appeared first on <a rel=\"nofollow\" href=\"http://www.careerealism.com\">CAREEREALISM</a>.</p>","direction":"ltr"},"visual":{"url":"http://img.youtube.com/vi/Hxrj32vO-Bo/0.jpg","height":360,"width":480,"processor":"feedly-nikon-v3.1","contentType":"image/jpeg"},"unread":true,"engagement":104,"engagementRate":2.26}]}